using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace homework2_csharp
{
    internal class Program
    {
        static void Main(string[] args)
        {
            //----------------------------1--------------------------------
            //1) Даны 2 массива размерности M и N соответственно. 
            //Необходимо переписать в третий массив общие элементы первых двух массивов без повторений.

            Array mas1 = new Array();
            mas1.name = "mas1";
            mas1.size = 10;
            mas1.InitializeArray();
            mas1.PrintArray();

            Array mas2 = new Array();
            mas2.name = "mas2";
            mas2.size = 15;
            mas2.InitializeArray();
            mas2.PrintArray();

            Array mas3 = new Array();
            mas3.name = "mas3";
            mas3.IntersectArrays(mas1.mas, mas2.mas);


            //Console.WriteLine(mas3.size);


            //----------------------------2--------------------------------
            //2) Пользователь вводит строку.Проверить, является ли эта строка палиндромом.
            //Палиндромом называется строка, которая одинаково читается слева направо и справа налево.



            //----------------------------3--------------------------------
            //3) Объявить одномерный(5 элементов) массив с именем A и двумерный массив(3 строки, 4 столбца) дробных чисел с именем B.
            //Заполнить одномерный массив А числами, введенными с клавиатуры пользователем, а двумерный массив В случайными числами с помощью циклов.
            //Вывести на экран значения массивов: массива А в одну строку, массива В — в виде матрицы.
            //Найти в данных массивах общий максимальный элемент, минимальный элемент, общую сумму всех элементов, общее произведение всех элементов, сумму четных элементов массива А, сумму нечетных столбцов массива В



            //----------------------------4--------------------------------
            //4) Дан двумерный массив размерностью 5 ? 5, заполненный случайными числами из диапазона от –100 до 100.
            //Определить сумму элементов массива, расположенных между минимальным и максимальным элементами

            Console.ReadKey();

        }
    }
}
